# üìä C√° th·ªÉ v√† Bi·∫øn trong D·ªØ li·ªáu

## 1Ô∏è‚É£ C√° th·ªÉ (Individuals / Observations)

**C√° th·ªÉ** l√† *ƒë·ªëi t∆∞·ª£ng* ƒë∆∞·ª£c nghi√™n c·ª©u trong m·ªôt b·ªô d·ªØ li·ªáu.

### üîπ V√≠ d·ª• v·ªÅ c√° th·ªÉ:

* Sinh vi√™n
* Kh√°ch h√†ng
* C√¥ng ty
* S·∫£n ph·∫©m
* Qu·ªëc gia
* Giao d·ªãch

üìå **Trong b·∫£ng d·ªØ li·ªáu:**

> üëâ 1 d√≤ng (row) = 1 c√° th·ªÉ

---

## 2Ô∏è‚É£ Bi·∫øn (Variables)

**Bi·∫øn** l√† nh·ªØng ƒë·∫∑c ƒëi·ªÉm ƒë∆∞·ª£c ƒëo l∆∞·ªùng ho·∫∑c xem x√©t tr√™n m·ªói c√° th·ªÉ.

üìå **Trong b·∫£ng d·ªØ li·ªáu:**

> üëâ 1 c·ªôt (column) = 1 bi·∫øn

### üîπ V√≠ d·ª•

C√° th·ªÉ **Sinh vi√™n** c√≥ th·ªÉ c√≥ c√°c bi·∫øn:

* *T√™n*
* *Tu·ªïi*
* *Gi·ªõi t√≠nh*
* *ƒêi·ªÉm*
* *Ng√†nh h·ªçc*

---

# üìÇ Ph√¢n lo·∫°i Bi·∫øn

## I. Bi·∫øn ƒë·ªãnh l∆∞·ª£ng (Quantitative / Numerical)

L√† bi·∫øn c√≥ gi√° tr·ªã **d·∫°ng s·ªë** v√† c√≥ th·ªÉ th·ª±c hi·ªán ph√©p t√≠nh to√°n h·ªçc.

### üîπ V√≠ d·ª•:

* Tu·ªïi
* Chi·ªÅu cao
* L∆∞∆°ng
* ƒêi·ªÉm thi

### üîπ C√≥ th·ªÉ t√≠nh:

* Trung b√¨nh (Mean)
* Ph∆∞∆°ng sai (Variance)
* ƒê·ªô l·ªách chu·∫©n (Standard Deviation)
* Min / Max
* Count

---

## II. Bi·∫øn ph√¢n lo·∫°i (Categorical / Qualitative)

L√† bi·∫øn chia d·ªØ li·ªáu th√†nh **nh√≥m ho·∫∑c lo·∫°i**.

### üîπ V√≠ d·ª•:

* Gi·ªõi t√≠nh (Nam / N·ªØ ‚Äì Male / Female)
* Qu·ªëc gia (Vietnam, Ph√°p, ƒê·ª©c, √ù, China)
* Nh√≥m m√°u (A / B / O / AB)

üìå C√°c bi·∫øn n√†y **kh√¥ng t√≠nh trung b√¨nh ƒë∆∞·ª£c** ‚Üí th∆∞·ªùng:

* ƒê·∫øm t·∫ßn su·∫•t
* ƒê·∫øm s·ªë l·∫ßn xu·∫•t hi·ªán
* T√≠nh t·ª∑ l·ªá (%)

---

# üìë C√°c lo·∫°i bi·∫øn ph√¢n lo·∫°i

## 1Ô∏è‚É£ Nominal (Kh√¥ng c√≥ th·ª© t·ª±)

Kh√¥ng c√≥ s·ª± x·∫øp h·∫°ng gi·ªØa c√°c nh√≥m.

V√≠ d·ª•:

* Gi·ªõi t√≠nh
* Qu·ªëc gia
* Nh√≥m m√°u

üëâ Kh√¥ng th·ªÉ n√≥i nh√≥m n√†o ‚Äúcao h∆°n‚Äù hay ‚Äúth·∫•p h∆°n‚Äù.

---

## 2Ô∏è‚É£ Ordinal (C√≥ th·ª© t·ª±)

C√≥ s·ª± x·∫øp h·∫°ng, nh∆∞ng **kh√¥ng ƒëo ƒë∆∞·ª£c kho·∫£ng c√°ch ch√≠nh x√°c gi·ªØa c√°c m·ª©c**.

### üîπ V√≠ d·ª•:

* M·ª©c ƒë·ªô h√†i l√≤ng:

  > Th·∫•p < Trung b√¨nh < Cao

* Tr√¨nh ƒë·ªô h·ªçc v·∫•n:

  > C·ª≠ nh√¢n < Th·∫°c sƒ© < Ti·∫øn sƒ©

* H·∫°ng:

  > 1, 2, 3

‚ö†Ô∏è C√≥ th·ª© t·ª± nh∆∞ng **kh√¥ng th·ªÉ t√≠nh to√°n kho·∫£ng c√°ch ch√≠nh x√°c** nh∆∞ bi·∫øn s·ªë.

## Dataframe
- l√† c·∫•u tr√∫c d·ªØ li·ªáu d·∫°ng b·∫£ng trong R
- g·ªìm c√°c h√†ng (rows) - c√° th·ªÉ
- c√°c c·ªôt (columns) = bi·∫øn

In [1]:
df <- data.frame(
    Name = c("John", "Jack", "Kenny", "Mary"),
    Age = c(20, 30, 50, 24),
    Gender = c("Male", "Male", "Male", "Female"),
    Score = c(80, 85, 90, 95)
)

df

  Name  Age Gender Score
1 John  20  Male   80
2 Jack  30  Male   85
3 Kenny 50  Male   90
4 Mary  24  Female 95

In [2]:
str(df) # Xem c·∫•u tr√∫c df

'data.frame':	4 obs. of  4 variables:
 $ Name  : chr  "John" "Jack" "Kenny" "Mary"
 $ Age   : num  20 30 50 24
 $ Gender: chr  "Male" "Male" "Male" "Female"
 $ Score : num  80 85 90 95

## L·ªçc d·ªØ li·ªáu - l·∫•y m·ªôt ph·∫ßn d·ªØ li·ªáu t·ª´ data set theo ƒëi·ªÅu ki·ªán
- **C√∫ ph√°p**: df[ƒëi·ªÅu ki·ªán h√†ng, ch·ªçn c·ªôt]

In [10]:
# Ch·ªçn sinh vi√™n c√≥ tu·ªïi > 30
df[df$Age > 30,]

  Name  Age Gender Score
3 Kenny 50  Male   90

In [11]:
df$Age > 30

[1] FALSE FALSE  TRUE FALSE

In [12]:
# L·∫•y ra 2 c·ªôt sau khi l·ªçc
df[df$Age > 21, c("Name", "Age")]

  Name  Age
2 Jack  30
3 Kenny 50
4 Mary  24

In [13]:
# Ch·ªçn h√†ng 1
df[1,]

  Name Age Gender Score
1 John 20  Male   80

In [14]:
# Ch·ªçn h√†ng 1 v√† 3
df[c(1, 3),]

  Name  Age Gender Score
1 John  20  Male   80
3 Kenny 50  Male   90

In [16]:
# B·ªè h√†ng 2
df[-2,]

  Name  Age Gender Score
1 John  20  Male   80
3 Kenny 50  Male   90
4 Mary  24  Female 95

In [17]:
# B·ªè nhi·ªÅu h√†ng (1,3)
df[-c(1,3),]

  Name Age Gender Score
2 Jack 30  Male   85
4 Mary 24  Female 95

In [19]:
subset(df, Age > 30) # <=> df[df$Age > 30,]

  Name  Age Gender Score
3 Kenny 50  Male   90

In [20]:
# AND (&)
df[df$Age > 20 & df$Gender == "Male",]

  Name  Age Gender Score
2 Jack  30  Male   85
3 Kenny 50  Male   90

In [22]:
# OR (|)
df[df$Age > 30 | df$Gender == "Female",]

  Name  Age Gender Score
3 Kenny 50  Male   90
4 Mary  24  Female 95

In [28]:
# Nh·ªõ: df[h√†ng, c·ªôt]